packetqc/MPLIB/MPLIB_APP_FRAMEWORK_H7_FREERTOS/MPLIB_APP_FRAMEWORK_H7_FREERTOS.ioc
#MicroXplorer Configuration settings - do not modify
ARM.CMSIS.5.9.0_SwParameter=CMSISOoDriverJjEthernetOoPHYJjCustom\:true;CMSISOoDriverJjEthernetOoMACJjCustom\:true;
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x24000000
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0xD0000000
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings=0xD0000000
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings=0x90000000
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings=0x90000000
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region5_Settings=0x30000000
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region6_Settings=0xD01F4000
CORTEX_M7.CPU_DCache=Enabled
CORTEX_M7.CPU_ICache=Enabled
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_INSTRUCTION_ACCESS_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_REGION_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_REGION_ENABLE
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region7_Settings=__NULL
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region8_Settings=__NULL
CORTEX_M7.IPParameters=CPU_ICache,CPU_DCache,MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings,Size-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region0_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region0_Settings,Enable-Cortex_Memory_Protection_Unit_Region1_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings,Size-Cortex_Memory_Protection_Unit_Region1_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings,Enable-Cortex_Memory_Protection_Unit_Region2_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings,Size-Cortex_Memory_Protection_Unit_Region2_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region2_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region2_Settings,Enable-Cortex_Memory_Protection_Unit_Region3_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings,Size-Cortex_Memory_Protection_Unit_Region3_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings,Enable-Cortex_Memory_Protection_Unit_Region4_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings,Size-Cortex_Memory_Protection_Unit_Region4_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region4_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region4_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region4_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings,Enable-Cortex_Memory_Protection_Unit_Region5_Settings,Enable-Cortex_Memory_Protection_Unit_Region6_Settings,default_mode_Activation,Enable-Cortex_Memory_Protection_Unit_Region7_Settings,Enable-Cortex_Memory_Protection_Unit_Region8_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region5_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region6_Settings,Size-Cortex_Memory_Protection_Unit_Region5_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region5_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region5_Settings,Size-Cortex_Memory_Protection_Unit_Region6_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region6_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region6_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region6_Settings,IsShareable-Cortex_Memory_Protection_Unit_Region6_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region6_Settings
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_ACCESS_NOT_BUFFERABLE
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7.IsShareable-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_ACCESS_SHAREABLE
CORTEX_M7.MPU_Control=MPU_PRIVILEGED_DEFAULT
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_SIZE_1MB
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_SIZE_512MB
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_SIZE_2MB
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_SIZE_512MB
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_SIZE_128MB
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_REGION_SIZE_512KB
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_REGION_SIZE_8MB
CORTEX_M7.default_mode_Activation=0
DMA2D.ColorMode=DMA2D_OUTPUT_RGB565
DMA2D.IPParameters=ColorMode,Mode
DMA2D.Mode=DMA2D_R2M
ETH.IPParameters=MediaInterface,TxDescAddress,MACAddr,RxDescAddress
ETH.MACAddr=00\:80\:E1\:11\:22\:55
ETH.MediaInterface=HAL_ETH_RMII_MODE
ETH.RxDescAddress=0x24000100
ETH.TxDescAddress=0x24000000
FATFS.BSP.number=1
FATFS.IPParameters=_FS_RPATH,_USE_FIND,_USE_LFN,_LFN_UNICODE,_USE_MUTEX,_VOLUMES
FATFS._FS_RPATH=2
FATFS._LFN_UNICODE=1
FATFS._USE_FIND=1
FATFS._USE_LFN=3
FATFS._USE_MUTEX=1
FATFS._VOLUMES=2
FATFS0.BSP.STBoard=false
FATFS0.BSP.api=Unknown
FATFS0.BSP.component=
FATFS0.BSP.condition=
FATFS0.BSP.instance=PB12
FATFS0.BSP.ip=GPIO
FATFS0.BSP.mode=Input
FATFS0.BSP.name=Detect_SDIO
FATFS0.BSP.semaphore=
FATFS0.BSP.solution=PB12
FMC.BankMapConfig=FMC_SWAPBMAP_DISABLE
FMC.IPParameters=BankMapConfig,ReadBurst1
FMC.ReadBurst1=FMC_SDRAM_RBURST_ENABLE
FREERTOS.Events01=ACTIVITY_INTERFACE,Dynamic,NULL;ACTIVITY_ENDPOINT,Dynamic,NULL;ACTIVITY_ETH_HANDLER,Dynamic,NULL
FREERTOS.FootprintOK=true
FREERTOS.HEAP_NUMBER=4
FREERTOS.IPParameters=Tasks01,FootprintOK,configUSE_APPLICATION_TASK_TAG,configUSE_IDLE_HOOK,configTOTAL_HEAP_SIZE,configUSE_NEWLIB_REENTRANT,Queues01,Mutexes01,configCHECK_FOR_STACK_OVERFLOW,HEAP_NUMBER,configMINIMAL_STACK_SIZE,Events01,configUSE_MALLOC_FAILED_HOOK
FREERTOS.Mutexes01=canLog,Dynamic,NULL
FREERTOS.Queues01=gui_msg,15,uint8_t,0,Dynamic,NULL,NULL;logs_msg,15,char*,0,Dynamic,NULL,NULL;gui_logs_msg,30,uint8_t,0,Dynamic,NULL,NULL;logsmon_msg,50,void*,0,Dynamic,NULL,NULL;ConnectionEvent,16,uint8_t,0,Dynamic,NULL,NULL
FREERTOS.Tasks01=defaultTask,24,4096,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL;TouchGFXTask,24,4096,TouchGFX_Task,As external,NULL,Dynamic,NULL,NULL;DataServicesTas,24,4096,StartDataServices,As external,NULL,Dynamic,NULL,NULL;SDServicesTask,24,4096,StartSDServices,As external,NULL,Dynamic,NULL,NULL;NetServicesTask,40,8192,StartNetServices,As external,NULL,Dynamic,NULL,NULL;MQTTServiceTask,8,8192,StartMQTTServices,As external,NULL,Dynamic,NULL,NULL;xIPTask,40,640,prvIPTask,As external,NULL,Static,xIPTaskBuffer,xIPTaskStack;xEMACTask,40,512,prvEMACHandlerTask,As external,NULL,Dynamic,NULL,NULL
FREERTOS.configCHECK_FOR_STACK_OVERFLOW=0
FREERTOS.configMINIMAL_STACK_SIZE=128
FREERTOS.configTOTAL_HEAP_SIZE=250000
FREERTOS.configUSE_APPLICATION_TASK_TAG=1
FREERTOS.configUSE_IDLE_HOOK=0
FREERTOS.configUSE_MALLOC_FAILED_HOOK=1
FREERTOS.configUSE_NEWLIB_REENTRANT=1
File.Version=6
GPIO.groupedBy=Show All
KeepUserPlacement=false
LTDC.Alpha0_L0=0
LTDC.Alpha_L0=255
LTDC.BlendingFactor1_L0=LTDC_BLENDING_FACTOR1_CA
LTDC.BlendingFactor2_L0=LTDC_BLENDING_FACTOR2_CA
LTDC.FBStartAdress_L0=0xD0000000
LTDC.HBP=114
LTDC.HFP=16
LTDC.HSync=30
LTDC.IPParameters=Layers,WindowX1_L0,WindowY1_L0,BlendingFactor1_L0,BlendingFactor2_L0,Alpha_L0,Alpha0_L0,PixelFormat_L0,ImageWidth_L0,ImageHeight_L0,FBStartAdress_L0,HSync,HBP,VSync,VBP,HFP,VFP
LTDC.ImageHeight_L0=480
LTDC.ImageWidth_L0=640
LTDC.Layers=0
LTDC.PixelFormat_L0=LTDC_PIXEL_FORMAT_RGB565
LTDC.VBP=32
LTDC.VFP=10
LTDC.VSync=3
LTDC.WindowX1_L0=640
LTDC.WindowY1_L0=480
MBEDTLS.IPParameters=MBEDTLS_SSL_CLI_C,MBEDTLS_TCP_IP,MBEDTLS_SSL_SRV_C,MBEDTLS_RNG_IP,MBEDTLS_TIMING_C,MBEDTLS_NO_DEFAULT_ENTROPY_SOURCES,MBEDTLS_NO_PLATFORM_ENTROPY,MBEDTLS_ENTROPY_NV_SEED,MBEDTLS_ENTROPY_HARDWARE_ALT,MBEDTLS_PLATFORM_NV_SEED_ALT,MBEDTLS_THREADING_C,MBEDTLS_ENTROPY_C,MBEDTLS_PLATFORM_STD_NV_SEED_READ_ENABLE,MBEDTLS_PLATFORM_STD_NV_SEED_WRITE_ENABLE,MBEDTLS_TEST_NULL_ENTROPY,MBEDTLS_ENTROPY_FORCE_SHA256,MBEDTLS_ENTROPY_MIN_HARDWARE_ENABLE,MBEDTLS_ENTROPY_MAX_SOURCES_ENABLE,MBEDTLS_ENTROPY_MAX_GATHER_ENABLE,MBEDTLS_PLATFORM_NV_SEED_WRITE_MACRO_ENABLE,MBEDTLS_PLATFORM_NV_SEED_READ_MACRO_ENABLE,MBEDTLS_CTR_DRBG_ENTROPY_LEN_ENABLE,MBEDTLS_PLATFORM_STD_NV_SEED_FILE_ENABLE,MBEDTLS_SSL_TRUNCATED_HMAC,MBEDTLS_BIGNUM_C,MBEDTLS_CAMELLIA_C,MBEDTLS_CHACHA20_C,MBEDTLS_DHM_C,MBEDTLS_PLATFORM_MEMORY,MBEDTLS_AESNI_C,MBEDTLS_ARC4_C,MBEDTLS_ARIA_C,MBEDTLS_CMAC_C,MBEDTLS_THREADING_PTHREAD,MBEDTLS_SSL_PROTO_TLS1,MBEDTLS_SSL_PROTO_TLS1_1,MBEDTLS_SSL_PROTO_DTLS,MBEDTLS_SHA1_C,MBEDTLS_BLOWFISH_C,MBEDTLS_DES_C,MBEDTLS_ECDH_C,MBEDTLS_ECP_C,MBEDTLS_MD5_C,MBEDTLS_PADLOCK_C,MBEDTLS_SSL_DEBUG_ALL,MBEDTLS_SSL_ASYNC_PRIVATE,MBEDTLS_DEBUG_C,MBEDTLS_MEMORY_BUFFER_ALLOC_C,MBEDTLS_SSL_SERVER_NAME_INDICATION,MBEDTLS_PKCS11_C,MBEDTLS_SSL_CBC_RECORD_SPLITTING,MBEDTLS_HAVE_ASM
MBEDTLS.MBEDTLS_AESNI_C=0
MBEDTLS.MBEDTLS_ARC4_C=0
MBEDTLS.MBEDTLS_ARIA_C=0
MBEDTLS.MBEDTLS_BIGNUM_C=1
MBEDTLS.MBEDTLS_BLOWFISH_C=0
MBEDTLS.MBEDTLS_CAMELLIA_C=0
MBEDTLS.MBEDTLS_CHACHA20_C=0
MBEDTLS.MBEDTLS_CMAC_C=1
MBEDTLS.MBEDTLS_CTR_DRBG_ENTROPY_LEN_ENABLE=0
MBEDTLS.MBEDTLS_DEBUG_C=1
MBEDTLS.MBEDTLS_DES_C=0
MBEDTLS.MBEDTLS_DHM_C=0
MBEDTLS.MBEDTLS_ECDH_C=0
MBEDTLS.MBEDTLS_ECP_C=0
MBEDTLS.MBEDTLS_ENTROPY_C=1
MBEDTLS.MBEDTLS_ENTROPY_FORCE_SHA256=1
MBEDTLS.MBEDTLS_ENTROPY_HARDWARE_ALT=1
MBEDTLS.MBEDTLS_ENTROPY_MAX_GATHER_ENABLE=0
MBEDTLS.MBEDTLS_ENTROPY_MAX_SOURCES_ENABLE=0
MBEDTLS.MBEDTLS_ENTROPY_MIN_HARDWARE_ENABLE=0
MBEDTLS.MBEDTLS_ENTROPY_NV_SEED=0
MBEDTLS.MBEDTLS_HAVE_ASM=0
MBEDTLS.MBEDTLS_MD5_C=0
MBEDTLS.MBEDTLS_MEMORY_BUFFER_ALLOC_C=0
MBEDTLS.MBEDTLS_NO_DEFAULT_ENTROPY_SOURCES=1
MBEDTLS.MBEDTLS_NO_PLATFORM_ENTROPY=1
MBEDTLS.MBEDTLS_PADLOCK_C=0
MBEDTLS.MBEDTLS_PKCS11_C=0
MBEDTLS.MBEDTLS_PLATFORM_MEMORY=1
MBEDTLS.MBEDTLS_PLATFORM_NV_SEED_ALT=0
MBEDTLS.MBEDTLS_PLATFORM_NV_SEED_READ_MACRO_ENABLE=0
MBEDTLS.MBEDTLS_PLATFORM_NV_SEED_WRITE_MACRO_ENABLE=0
MBEDTLS.MBEDTLS_PLATFORM_STD_NV_SEED_FILE_ENABLE=0
MBEDTLS.MBEDTLS_PLATFORM_STD_NV_SEED_READ_ENABLE=0
MBEDTLS.MBEDTLS_PLATFORM_STD_NV_SEED_WRITE_ENABLE=0
MBEDTLS.MBEDTLS_RNG_IP=HW_RNG
MBEDTLS.MBEDTLS_SHA1_C=1
MBEDTLS.MBEDTLS_SSL_ASYNC_PRIVATE=1
MBEDTLS.MBEDTLS_SSL_CBC_RECORD_SPLITTING=0
MBEDTLS.MBEDTLS_SSL_CLI_C=1
MBEDTLS.MBEDTLS_SSL_DEBUG_ALL=1
MBEDTLS.MBEDTLS_SSL_PROTO_DTLS=0
MBEDTLS.MBEDTLS_SSL_PROTO_TLS1=0
MBEDTLS.MBEDTLS_SSL_PROTO_TLS1_1=0
MBEDTLS.MBEDTLS_SSL_SERVER_NAME_INDICATION=1
MBEDTLS.MBEDTLS_SSL_SRV_C=0
MBEDTLS.MBEDTLS_SSL_TRUNCATED_HMAC=0
MBEDTLS.MBEDTLS_TCP_IP=1
MBEDTLS.MBEDTLS_TEST_NULL_ENTROPY=0
MBEDTLS.MBEDTLS_THREADING_C=0
MBEDTLS.MBEDTLS_THREADING_PTHREAD=0
MBEDTLS.MBEDTLS_TIMING_C=0
MMTAppRegionsCount=0
MMTConfigApplied=false
Mcu.CPN=STM32H743XIH6
Mcu.Family=STM32H7
Mcu.IP0=CORTEX_M7
Mcu.IP1=CRC
Mcu.IP10=NVIC
Mcu.IP11=QUADSPI
Mcu.IP12=RCC
Mcu.IP13=RNG
Mcu.IP14=SDMMC1
Mcu.IP15=SYS
Mcu.IP2=DMA2D
Mcu.IP3=ETH
Mcu.IP4=FATFS
Mcu.IP5=FMC
Mcu.IP6=FREERTOS
Mcu.IP7=LTDC
Mcu.IP8=MBEDTLS
Mcu.IP9=MEMORYMAP
Mcu.IPNb=16
Mcu.Name=STM32H743XIHx
Mcu.Package=TFBGA240
Mcu.Pin0=PI6
Mcu.Pin1=PI5
Mcu.Pin10=PE1
Mcu.Pin100=PF11
Mcu.Pin101=PG0
Mcu.Pin102=PE8
Mcu.Pin103=PE13
Mcu.Pin104=PH8
Mcu.Pin105=PB12
Mcu.Pin106=PD10
Mcu.Pin107=PD9
Mcu.Pin108=PA3
Mcu.Pin109=PA4
Mcu.Pin11=PB6
Mcu.Pin110=PC5
Mcu.Pin111=PJ3
Mcu.Pin112=PJ4
Mcu.Pin113=PE7
Mcu.Pin114=PE14
Mcu.Pin115=PD8
Mcu.Pin116=VP_CRC_VS_CRC
Mcu.Pin117=VP_DMA2D_VS_DMA2D
Mcu.Pin118=VP_FATFS_VS_SDIO
Mcu.Pin119=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin12=PK4
Mcu.Pin120=VP_MBEDTLS_VS_MBEDTLS
Mcu.Pin121=VP_RNG_VS_RNG
Mcu.Pin122=VP_SYS_VS_tim6
Mcu.Pin123=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin124=VP_STMicroelectronics.X-CUBE-TOUCHGFX_VS_GraphicsJjApplication_4.23.2
Mcu.Pin13=PG11
Mcu.Pin14=PJ15
Mcu.Pin15=PD3
Mcu.Pin16=PC11
Mcu.Pin17=PI2
Mcu.Pin18=PH15
Mcu.Pin19=PH14
Mcu.Pin2=PI4
Mcu.Pin20=PE0
Mcu.Pin21=PB7
Mcu.Pin22=PB3 (JTDO/TRACESWO)
Mcu.Pin23=PK6
Mcu.Pin24=PK3
Mcu.Pin25=PG12
Mcu.Pin26=PC12
Mcu.Pin27=PI3
Mcu.Pin28=PB9
Mcu.Pin29=PB8
Mcu.Pin3=PB5
Mcu.Pin30=PG15
Mcu.Pin31=PK7
Mcu.Pin32=PG14
Mcu.Pin33=PG13
Mcu.Pin34=PD2
Mcu.Pin35=PD0
Mcu.Pin36=PH13
Mcu.Pin37=PI9
Mcu.Pin38=PD1
Mcu.Pin39=PC8
Mcu.Pin4=PK5
Mcu.Pin40=PC9
Mcu.Pin41=PI10
Mcu.Pin42=PC7
Mcu.Pin43=PC6
Mcu.Pin44=PG8
Mcu.Pin45=PF2
Mcu.Pin46=PF1
Mcu.Pin47=PF0
Mcu.Pin48=PG6
Mcu.Pin49=PI12
Mcu.Pin5=PG9
Mcu.Pin50=PI13
Mcu.Pin51=PI14
Mcu.Pin52=PF3
Mcu.Pin53=PG4
Mcu.Pin54=PK2
Mcu.Pin55=PH1-OSC_OUT (PH1)
Mcu.Pin56=PH0-OSC_IN (PH0)
Mcu.Pin57=PF5
Mcu.Pin58=PF4
Mcu.Pin59=PK0
Mcu.Pin6=PC10
Mcu.Pin60=PK1
Mcu.Pin61=PF6
Mcu.Pin62=PF7
Mcu.Pin63=PF8
Mcu.Pin64=PJ11
Mcu.Pin65=PC0
Mcu.Pin66=PF9
Mcu.Pin67=PJ10
Mcu.Pin68=PC1
Mcu.Pin69=PC2
Mcu.Pin7=PI1
Mcu.Pin70=PC3
Mcu.Pin71=PJ9
Mcu.Pin72=PH2
Mcu.Pin73=PA2
Mcu.Pin74=PA1
Mcu.Pin75=PJ0
Mcu.Pin76=PE10
Mcu.Pin77=PJ6
Mcu.Pin78=PH3
Mcu.Pin79=PI15
Mcu.Pin8=PI0
Mcu.Pin80=PF13
Mcu.Pin81=PF14
Mcu.Pin82=PE9
Mcu.Pin83=PE11
Mcu.Pin84=PH10
Mcu.Pin85=PH11
Mcu.Pin86=PD15
Mcu.Pin87=PD14
Mcu.Pin88=PA6
Mcu.Pin89=PA7
Mcu.Pin9=PI7
Mcu.Pin90=PB2
Mcu.Pin91=PF12
Mcu.Pin92=PF15
Mcu.Pin93=PE12
Mcu.Pin94=PE15
Mcu.Pin95=PJ5
Mcu.Pin96=PH9
Mcu.Pin97=PH12
Mcu.Pin98=PC4
Mcu.Pin99=PJ2
Mcu.PinsNb=125
Mcu.ThirdParty0=ARM.CMSIS.5.9.0
Mcu.ThirdParty1=STMicroelectronics.X-CUBE-TOUCHGFX.4.23.2
Mcu.ThirdParty2=lwIP.lwIP.2.2.0
Mcu.ThirdPartyNb=3
Mcu.UserConstants=
Mcu.UserName=STM32H743XIHx
MxCube.Version=6.14.0
MxDb.Version=DB.6.0.140
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.DMA2D_IRQn=true\:6\:0\:true\:false\:true\:true\:true\:true\:true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.ETH_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.LTDC_IRQn=true\:15\:0\:true\:false\:true\:false\:true\:true\:true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SDMMC1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC.SavedPendsvIrqHandlerGenerated=true
NVIC.SavedSvcallIrqHandlerGenerated=true
NVIC.SavedSystickIrqHandlerGenerated=true
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true\:false
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TimeBase=TIM6_DAC_IRQn
NVIC.TimeBaseIP=TIM6
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
PA1.GPIOParameters=GPIO_Speed
PA1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA1.Mode=RMII
PA1.Signal=ETH_REF_CLK
PA2.GPIOParameters=GPIO_Speed
PA2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA2.Mode=RMII
PA2.Signal=ETH_MDIO
PA3.GPIOParameters=GPIO_Speed,GPIO_Label
PA3.GPIO_Label=FRAME_RATE
PA3.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA3.Locked=true
PA3.Signal=GPIO_Output
PA4.GPIOParameters=GPIO_Label
PA4.GPIO_Label=LCD_RESET
PA4.Locked=true
PA4.Signal=GPIO_Output
PA6.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PA6.GPIO_Label=LCD_BL_CTRL
PA6.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA6.Locked=true
PA6.PinState=GPIO_PIN_SET
PA6.Signal=GPIO_Output
PA7.GPIOParameters=GPIO_Speed
PA7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA7.Mode=RMII
PA7.Signal=ETH_CRS_DV
PB12.Locked=true
PB12.Signal=GPIO_Input
PB2.GPIOParameters=GPIO_Speed
PB2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB2.Locked=true
PB2.Mode=Dual_Bank
PB2.Signal=QUADSPI_CLK
PB3\ (JTDO/TRACESWO).GPIOParameters=GPIO_Speed,GPIO_Label
PB3\ (JTDO/TRACESWO).GPIO_Label=VSYNC_FREQ
PB3\ (JTDO/TRACESWO).GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
